Starting with bucket configuration on 2.15. 

## Running plan before any changes 
``` 
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```
This goes as planned 👍 

## Removing the .terraform folder and lock file and running terraform init to get the newest s3 module 
```
... 
Downloading registry.terraform.io/terraform-aws-modules/s3-bucket/aws 3.0.1 for s3_my_bucket...
- s3_imagestore_cloudflare in .terraform/modules/s3_my_bucket

... 

Successfully configured the backend "remote"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding latest version of hashicorp/tfe...
- Finding hashicorp/aws versions matching ">= 2.23.0, ~> 3.0, >= 3.35.0, >= 3.64.0, >= 3.75.0"...
- Installing hashicorp/tfe v0.30.2...
- Installed hashicorp/tfe v0.30.2 (signed by HashiCorp)
- Installing hashicorp/aws v3.75.1...
- Installed hashicorp/aws v3.75.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
``` 

## Running plan after upgrading module which produces the following changes 
What is worth noticing here is that the lifecycle rule created does not have a prefix which I require ( created on the original bucket)
```
  # module.s3_my_bucket.aws_s3_bucket_acl.this[0] will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = "s3_my_bucket"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.s3_my_bucket.aws_s3_bucket_lifecycle_configuration.this[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket = "s3_my_bucket"
      + id     = (known after apply)

      + rule {
          + id     = "delete-legacy-resized-images"
          + status = "Enabled"

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 1
            }

          + expiration {
              + days                         = 1
              + expired_object_delete_marker = false
            }

          + filter {
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 1
            }
        }
    }

  # module.s3_my_bucket.aws_s3_bucket_logging.this[0] will be created
  + resource "aws_s3_bucket_logging" "this" {
      + bucket        = "s3_my_bucket"
      + id            = (known after apply)
      + target_bucket = "aws-account-logs"
      + target_prefix = "s3/s3_my_bucket/"
    }

  # module.s3_my_bucket.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = "s3_my_bucket"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Suspended"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

## ACLs are fixed by doing import of resources ( as per upgrade document ) 
👍 

## To fix the prefix we need to update to new syntax based on the updated module - so in instead of plain `prefix` we need to use `filter` object.

> This part I have not seen in the upgrade document - figured that out by browsing newest example

```
      filter = {
        prefix = "images/"
      }
```

```
  # module.s3_my_bucket.aws_s3_bucket_lifecycle_configuration.this[0] will be updated in-place
  ~ resource "aws_s3_bucket_lifecycle_configuration" "this" {
        id     = "obscured-some-name"
        # (1 unchanged attribute hidden)

      ~ rule {
            id     = "delete-legacy-resized-images"
            # (1 unchanged attribute hidden)



          ~ filter {
              + prefix = "images/"
            }

            # (3 unchanged blocks hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```


After that & syntax change for `filter` now it works as expected :) 
